   
       IDENTIFICATION DIVISION.
       PROGRAM-ID.  MYPROG.
       PROCEDURE DIVISION.
           DISPLAY "Hello, world!".
           STOP RUN.



           